#Електронний годинник показує час в форматі h: mm: ss, тобто спочатку записується кількість годин 
#(число від 0 до 23, потім обов’язково двозначна кількість хвилин, потім обов’язково двозначна кількість секунд. 
#Кількість хвилин і секунд при необхідності доповнюються до двозначного числа нулями. 
#З початку доби минуло n секунд. Виведіть, що покаже годинник.
#Буртенко 31І
total_seconds = int(input("Введіть кількість секунд з початку доби: "))

hours = total_seconds // 3600 
remaining_seconds = total_seconds % 3600  

minutes = remaining_seconds // 60  
seconds = remaining_seconds % 60  

formatted_time = f"{hours}:{minutes:02d}:{seconds:02d}"

print("Час на годиннику після", total_seconds, "секунд з початку доби: ", formatted_time)
